[MooseCheckCommandlet]
HelpDescription="Verifica certos elementos em cada pacote."
HelpUsage="gamename.exe MooseCheck <package.classname> [package.classname package.classname ...] [-switches...]"
HelpParamNames[0]="package.classname"
HelpParamDescriptions[0]="O caminho completo para a classe a ser procurada, por exemplo Engine.LightComponent"
HelpParamNames[1]="-ExactClass"
HelpParamDescriptions[1]="Indica que apenas objetos dessa classe devem ser contados. O comportamento padrão é contar também objetos de classes derivadas da classe especificada."
HelpParamNames[2]="-IncludeScript"
HelpParamDescriptions[2]="Indica que pacotes que contêm UnrealScript (geralmente apenas pacotes .u) também devem ser pesquisados."
HelpParamNames[3]="-IncludeCooked"
HelpParamDescriptions[3]="Indica que pacotes que foram compilados para uma plataforma de console também devem ser pesquisados."
HelpParamNames[4]="-CookedOnly"
HelpParamDescriptions[4]="Indica que apenas os pacotes que foram compilados para uma plataforma de console devem ser pesquisados."
HelpParamNames[5]="-SkipClientOnly"
HelpParamDescriptions[5]="Indica que quaisquer objetos que estão configurados para carregar apenas no cliente devem ser ignorados."
HelpParamNames[6]="-SkipServerOnly"
HelpParamDescriptions[6]="Indica que quaisquer objetos que estão configurados para carregar apenas no servidor devem ser ignorados."
HelpParamNames[7]="-SkipEditorOnly"
HelpParamDescriptions[7]="Indica que quaisquer objetos que estão configurados para carregar apenas no editor devem ser ignorados."
HelpParamNames[8]="-IgnoreWriteable"
HelpParamDescriptions[8]="Indica que apenas pacotes somente leitura devem ser verificados (útil para evitar pacotes de teste antigos que podem causar falhas no comando)."
HelpParamNames[9]="-IgnoreMaps"
HelpParamDescriptions[9]="Indica que pacotes de mapa devem ser pulados (acelera a execução quando o objeto que você deseja listar não pode ser colocado em mapas)."
HelpParamNames[10]="-ObjectNames"
HelpParamDescriptions[10]="Exibe o caminho completo de todos os objetos encontrados pelo comando."
HelpParamNames[11]="-AllowNonVignettes"
HelpParamDescriptions[11]="Verifica mapas que não são vignettes."
HelpParamNames[12]="-DontCheckDynamicLights"
HelpParamDescriptions[12]="Pula a verificação de luzes dinâmicas."
